In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import sqlalchemy

In [2]:
%load_ext sql
from sqlalchemy import engine

In [3]:
engine = sqlalchemy.create_engine('postgresql://postgres:polpol@localhost:5432/booksys')
connection = engine.connect()

In [4]:

df = pd.read_csv('/Users/da_m1_52/Downloads/AirBNB_modified.csv')

df.to_sql('AirBNB_modified', engine, if_exists='replace', index=False, chunksize=478741)

858

In [5]:
%sql postgresql://postgres:polpol@localhost:5432/booksys

In [47]:
%%sql
SELECT * FROM  "AirBNB_modified"  limit 10;

 * postgresql://postgres:***@localhost:5432/booksys
10 rows affected.

[(2539, 'Clean & quiet apt home by the park', 2787, 'John', 'Brooklyn', 'Kensington', 40.64749, -73.97237, 'Private room', 149, 1, 9, '2018-10-19', 0.21, 6, 365, 19, 'October', 2018, 'Fall', 'Brooklyn'),
 (2595, 'Skylit Midtown Castle', 2845, 'Jennifer', 'Manhattan', 'Midtown', 40.75362, -73.98377, 'Entire home/apt', 225, 1, 45, '2019-05-21', 0.38, 2, 355, 21, 'May', 2019, 'Spring', 'Manhattan'),
 (3647, 'THE VILLAGE OF HARLEM....NEW YORK !', 4632, 'Elisabeth', 'Manhattan', 'Harlem', 40.80902, -73.9419, 'Private room', 150, 3, 0, '2019-05-21', 1.37, 1, 365, 21, 'May', 2019, 'Spring', 'Manhattan'),
 (3831, 'Cozy Entire Floor of Brownstone', 4869, 'LisaRoxanne', 'Brooklyn', 'Clinton Hill', 40.68514, -73.95976, 'Entire home/apt', 89, 1, 270, '2019-07-05', 4.64, 1, 194, 5, 'July', 2019, 'Summer', 'Brooklyn'),
 (5022, 'Entire Apt: Spacious Studio/Loft by central park', 7192, 'Laura', 'Manhattan', 'East Harlem', 40.79851, -73.94399, 'Entire home/apt', 80, 10, 9, '2018-11-19', 0.1, 1, 0, 19, 'November', 2018, 'Fall', 'Manhattan'),
 (5099, 'Large Cozy 1 BR Apartment In Midtown East', 7322, 'Chris', 'Manhattan', 'Murray Hill', 40.74767, -73.975, 'Entire home/apt', 200, 3, 74, '2019-06-22', 0.59, 1, 129, 22, 'June', 2019, 'Summer', 'Manhattan'),
 (5121, 'BlissArtsSpace!', 7356, 'Garon', 'Brooklyn', 'Bedford-Stuyvesant', 40.68688, -73.95596, 'Private room', 60, 45, 49, '2017-10-05', 0.4, 1, 0, 5, 'October', 2017, 'Fall', 'Brooklyn'),
 (5178, "Large Furnished Room Near B'way ", 8967, 'Shunichi', 'Manhattan', "Hell's Kitchen", 40.76489, -73.98493, 'Private room', 79, 2, 430, '2019-06-24', 3.47, 1, 220, 24, 'June', 2019, 'Summer', 'Manhattan'),
 (5203, 'Cozy Clean Guest Room - Family Apt', 7490, 'MaryEllen', 'Manhattan', 'Upper West Side', 40.80178, -73.96723, 'Private room', 79, 2, 118, '2017-07-21', 0.99, 1, 0, 21, 'July', 2017, 'Summer', 'Manhattan'),
 (5238, 'Cute & Cozy Lower East Side 1 bdrm', 7549, 'Ben', 'Manhattan', 'Chinatown', 40.71344, -73.99037, 'Entire home/apt', 150, 1, 160, '2019-06-09', 1.33, 4, 188, 9, 'June', 2019, 'Summer', 'Manhattan')]

In [39]:
%%sql
SELECT name
FROM "AirBNB_modified"
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/booksys
10 rows affected.

[('Clean & quiet apt home by the park',),
 ('Skylit Midtown Castle',),
 ('THE VILLAGE OF HARLEM....NEW YORK !',),
 ('Cozy Entire Floor of Brownstone',),
 ('Entire Apt: Spacious Studio/Loft by central park',),
 ('Large Cozy 1 BR Apartment In Midtown East',),
 ('BlissArtsSpace!',),
 ("Large Furnished Room Near B'way ",),
 ('Cozy Clean Guest Room - Family Apt',),
 ('Cute & Cozy Lower East Side 1 bdrm',)]

In [46]:
%%sql

SELECT "room_type", COUNT(*) AS count
FROM "AirBNB_modified"
GROUP BY "room_type"
ORDER BY count DESC;

 * postgresql://postgres:***@localhost:5432/booksys
3 rows affected.

[('Entire home/apt', 25393), ('Private room', 22306), ('Shared room', 1159)]

In [90]:
%%sql
SELECT "neighbourhood_group", AVG(price)::numeric(10, 2) AS average_price
FROM "AirBNB_modified"
GROUP BY "neighbourhood_group";

 * postgresql://postgres:***@localhost:5432/booksys
5 rows affected.

[('Queens', Decimal('99.54')),
 ('Brooklyn', Decimal('124.41')),
 ('Staten Island', Decimal('114.81')),
 ('Manhattan', Decimal('196.90')),
 ('Bronx', Decimal('87.47'))]

In [89]:
%%sql

SELECT "room_type", AVG(price)::numeric(10, 2) AS average_price
FROM "AirBNB_modified"
GROUP BY "room_type";

 * postgresql://postgres:***@localhost:5432/booksys
3 rows affected.

[('Entire home/apt', Decimal('211.81')),
 ('Shared room', Decimal('70.08')),
 ('Private room', Decimal('89.79'))]

In [88]:
%%sql
SELECT "availability_365", AVG(price)::numeric(10, 2) AS average_price
FROM "AirBNB_modified"
GROUP BY "availability_365"
limit 5;

 * postgresql://postgres:***@localhost:5432/booksys
5 rows affected.

[(351, Decimal('163.29')),
 (184, Decimal('161.30')),
 (87, Decimal('158.84')),
 (116, Decimal('189.24')),
 (273, Decimal('204.40'))]

In [84]:
%%sql

SELECT "availability_365", "room_type", AVG(price)::numeric(10, 2) AS average_price
FROM "AirBNB_modified"
GROUP BY "availability_365", "room_type"
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/booksys
5 rows affected.

[(230, 'Entire home/apt', Decimal('214.36')),
 (10, 'Private room', Decimal('79.53')),
 (294, 'Shared room', Decimal('45.00')),
 (177, 'Entire home/apt', Decimal('257.21')),
 (271, 'Entire home/apt', Decimal('177.03'))]

In [58]:
%%sql
SELECT "neighbourhood_group", MIN(price) AS min_price, MAX(price) AS max_price
FROM "AirBNB_modified"
GROUP BY "neighbourhood_group";

 * postgresql://postgres:***@localhost:5432/booksys
5 rows affected.

[('Queens', 10, 10000),
 ('Brooklyn', 0, 10000),
 ('Staten Island', 13, 5000),
 ('Manhattan', 0, 10000),
 ('Bronx', 0, 2500)]

In [109]:
%%sql

SELECT CORR("price", "availability_365") AS correlation
FROM "AirBNB_modified";

 * postgresql://postgres:***@localhost:5432/booksys
1 rows affected.

[(0.0818170955082679,)]

In [110]:
%%sql
SELECT "Month", ROUND(CORR("price", "number_of_reviews")::numeric, 2) AS correlation
FROM "AirBNB_modified"
GROUP BY "Month";

 * postgresql://postgres:***@localhost:5432/booksys
12 rows affected.

[('June', Decimal('-0.07')),
 ('November', Decimal('-0.03')),
 ('March', Decimal('-0.02')),
 ('August', Decimal('0.00')),
 ('December', Decimal('-0.03')),
 ('January', Decimal('-0.03')),
 ('July', Decimal('-0.06')),
 ('April', Decimal('-0.04')),
 ('February', Decimal('-0.03')),
 ('May', Decimal('-0.05')),
 ('September', Decimal('-0.02')),
 ('October', Decimal('-0.04'))]

In [91]:
%%sql

SELECT "neighbourhood_group",  AVG(number_of_reviews)::numeric(10, 2) AS average_reviews
FROM "AirBNB_modified"
GROUP BY "neighbourhood_group";

 * postgresql://postgres:***@localhost:5432/booksys
5 rows affected.

[('Queens', Decimal('27.70')),
 ('Brooklyn', Decimal('24.20')),
 ('Staten Island', Decimal('30.94')),
 ('Manhattan', Decimal('20.98')),
 ('Bronx', Decimal('26.02'))]

In [69]:
%%sql

SELECT "host_id", COUNT(*) AS calculated_host_listings_count
FROM "AirBNB_modified"
GROUP BY "host_id"
ORDER BY "calculated_host_listings_count" DESC
limit 5;

 * postgresql://postgres:***@localhost:5432/booksys
5 rows affected.

[(219517861, 327),
 (107434423, 232),
 (30283594, 121),
 (137358866, 103),
 (16098958, 96)]

In [101]:
%%sql

SELECT "Month", COUNT(*) AS review_count
FROM "AirBNB_modified"
GROUP BY "Month"
ORDER BY "Month" ASC;

 * postgresql://postgres:***@localhost:5432/booksys
12 rows affected.

[('April', 2612),
 ('August', 1997),
 ('December', 2140),
 ('February', 949),
 ('January', 3445),
 ('July', 8289),
 ('June', 17114),
 ('March', 1584),
 ('May', 5717),
 ('November', 1353),
 ('October', 1814),
 ('September', 1844)]

In [97]:
%%sql
SELECT "Month", COUNT(*) AS review_count
FROM "AirBNB_modified"
GROUP BY "Month"
ORDER BY DATE_PART('month', "Month");

 * postgresql://postgres:***@localhost:5432/booksys
(psycopg2.errors.UndefinedFunction) function date_part(unknown, text) does not exist
LINE 4: ORDER BY DATE_PART('month', "Month");
                 ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.

[SQL: SELECT "Month", COUNT(*) AS review_count
FROM "AirBNB_modified"
GROUP BY "Month"
ORDER BY DATE_PART('month', "Month");]
(Background on this error at: https://sqlalche.me/e/20/f405)